[
  {
    "id": "dc73abc1-8699-4e0a-91b0-a67e80292b9c",
    "title": "Frankenstein",
    "author": "Mary Shelley",
    "genre": "Gothic / Science Fiction",
    "rating": 3,
    "coverUrl": "https://m.media-amazon.com/images/I/61Yr2vYVYZL._SL1491_.jpg",
    "coverColor": "#B2B6A7",
    "description": "A brilliant but egotistical scientist brings a creature to life in a monstrous experiment that ultimately leads to the undoing of both the creator and his tragic creation.",
    "totalCopies": 78,
    "availableCopies": 78,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_VGtFawJik.png",
    "summary": "Frankenstein tells the story of Victor Frankenstein, a young scientist who becomes obsessed with creating life. Through his experiments, he succeeds in animating a creature, but is horrified by its appearance and abandons it.\n\nThe creature, intelligent and sensitive, struggles with isolation and rejection, seeking understanding and companionship but encountering only fear and hostility.\n\nShelley explores themes of ambition, responsibility, morality, and the ethical limits of scientific pursuit. The narrative examines the consequences of unchecked obsession and the human desire to transcend natural boundaries.\n\nThrough the intertwined fates of Victor and his creation, the novel highlights the dangers of playing God and the tragic impact of neglect, prejudice, and vengeance, making it a timeless reflection on humanity and its responsibilities."
  },
  {
    "id": "17a58b62-0258-45a5-8b8b-9a21a6d6630c",
    "title": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "genre": "Classic / Fiction",
    "rating": 5,
    "coverUrl": "https://m.media-amazon.com/images/I/81tn3IljAUL._SL1500_.jpg",
    "coverColor": "#0F223A",
    "description": "An intoxicating glimpse into the Jazz Age's glittering excess, where the elusive Gatsby chases a dream as fragile and fleeting as a green light across the bay.",
    "totalCopies": 45,
    "availableCopies": 45,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_LhwRi_a9cJ.png",
    "summary": "The Great Gatsby by F. Scott Fitzgerald is a novel that explores themes of wealth, ambition, love, and the American Dream. The story is narrated by Nick Carraway, who moves to West Egg, Long Island, and becomes fascinated by his enigmatic neighbor, Jay Gatsby, a wealthy and mysterious man known for his lavish parties.\n\nGatsby is driven by his idealized love for Daisy Buchanan, a married woman from a wealthy background, and devotes his life to recreating the past and winning her affection. As Nick observes the lives of Gatsby, Daisy, and the morally careless elite around them, he uncovers the illusions, excesses, and moral decay hidden beneath the glittering surface of wealth and glamour.\n\nThe novel culminates in tragedy, revealing the destructive power of obsession, the impossibility of recapturing the past, and the harsh realities behind the American Dream. Fitzgerald’s work remains a poignant critique of desire, social ambition, and the emptiness of materialism."
  },
  {
    "id": "91445e57-01a8-4e1e-bb18-cf04b3a0b7d1",
    "title": "Electronics for Inventors",
    "author": "Paul Scherz",
    "genre": "Engineering",
    "rating": 4,
    "coverUrl": "https://m.media-amazon.com/images/I/61JtUKEfXQL._SL1000_.jpg",
    "coverColor": "#CD602E",
    "description": "Advance your electronics knowledge and gain the skills necessary to develop and construct your own functioning gadgets.",
    "totalCopies": 145,
    "availableCopies": 145,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_UZULgWXVA.png",
    "summary": "Advance your electronics knowledge and gain the skills necessary to develop and construct your own functioning gadgets. Written by a pair of experienced engineers and dedicated hobbyists, Practical Electronics for Inventors, Fourth Edition, lays out the essentials and provides step by step instructions, schematics, and illustrations. \n\nDiscover how to select the right components, design and build circuits, use microcontrollers and ICs, work with the latest software tools, and test and tweak your creations. This easy to follow book features new instruction on programmable logic, semiconductors, operational amplifiers, voltage regulators, power supplies, digital electronics, and more."
  },
  {
    "id": "c3f2ff59-a3c2-47d2-a793-93457a9dccf7",
    "title": "Pride & Prejudice",
    "author": "Jane Austen",
    "genre": "Literature",
    "rating": 5,
    "coverUrl": "https://m.media-amazon.com/images/I/91MfFBRDceL._SL1500_.jpg",
    "coverColor": "#3C5486",
    "description": "A sparkling dance of wit and romance, where fiery Elizabeth Bennet challenges societal norms and the enigmatic Mr. Darcy in a timeless battle of pride and passion.",
    "totalCopies": 97,
    "availableCopies": 97,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_rkMFYr5J0.png",
    "summary": "Pride and Prejudice by Jane Austen is a classic novel that explores themes of love, social class, and personal growth. The story follows Elizabeth Bennet, a sharp-witted and independent young woman, as she navigates the expectations of society and her own judgments about character and marriage.\n\nElizabeth’s initial impressions of the proud and reserved Mr. Darcy lead to misunderstandings and mutual prejudice. Through a series of social events, personal revelations, and moments of self-reflection, both Elizabeth and Darcy confront their flaws—her tendency to judge too quickly and his pride and aloofness. Their evolving understanding of each other highlights the importance of humility, empathy, and integrity.\n\nUltimately, Elizabeth and Darcy overcome their misjudgments and societal pressures, finding love based on respect, mutual understanding, and genuine affection. The novel combines sharp social commentary with romance, offering enduring insights into human relationships and societal expectations."
  },
  {
    "id": "fe03e013-53b8-4574-9ca8-caec69a9b16c",
    "title": "Algorithms",
    "author": "Robert Sedgewick and Kevin Wayne",
    "genre": "Computer Science",
    "rating": 5,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_dr-f_LPwA.png",
    "coverColor": "#bf1e2e",
    "description": "Algorithms by Robert Sedgewick and Kevin Wayne is a comprehensive and authoritative guide to understanding algorithms and their role in modern computing. Widely regarded as a foundational text in computer science, the book covers a vast array of algorithms, ranging from sorting and searching to graph processing and string manipulation.",
    "totalCopies": 321,
    "availableCopies": 318,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_KSZGUHg5R.png",
    "summary": "Algorithms is a thorough exploration of algorithmic principles and their applications. It begins with the basics, introducing elementary algorithms like sorting and searching. These foundational topics are covered in-depth, explaining their importance in handling data efficiently and effectively.\n\nThe book then progresses to more complex topics, such as graph algorithms and string processing. Graph processing, for instance, is explained with practical use cases like network connectivity, shortest paths, and spanning trees. Similarly, string algorithms address challenges in pattern matching and text analysis, offering insights into their relevance in fields like bioinformatics and search engines.\n\nThroughout the book, the authors emphasize the design and analysis of algorithms. They focus on efficiency and scalability, equipping readers with the tools to evaluate performance and choose appropriate algorithms for specific tasks.\n\nPractical implementation is a major focus, with the authors providing code examples and exercises that reinforce learning. The book strikes a balance between theory and practice, ensuring readers gain both conceptual knowledge and hands-on skills to solve real-world problems effectively."
  },
  {
    "id": "cea639ce-ee90-4ef9-9fef-c9562a247e99",
    "title": "The Brothers Karamazov",
    "author": "Fyodor Dostoevsky",
    "genre": "Philosophy / Drama",
    "rating": 4,
    "coverUrl": "https://m.media-amazon.com/images/I/71agR0zF7mL._SL1200_.jpg",
    "coverColor": "#1E73BE",
    "description": "A profound exploration of faith, doubt, morality, and family dynamics, centered on the lives of the troubled Karamazov brothers.",
    "totalCopies": 17,
    "availableCopies": 17,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_uiRdVQTTm.png",
    "summary": "The Brothers Karamazov explores the lives of the Karamazov family, focusing on the three brothers—Dmitri, Ivan, and Alyosha—each representing different aspects of human nature. The novel blends family drama with philosophical inquiry, tackling questions about morality, faith, and free will.\n\nThe story revolves around the murder of their father, Fyodor Pavlovich, and the moral and emotional turmoil it causes. Each brother reacts differently, reflecting their values and inner struggles.\n\nThroughout the book, Dostoevsky presents deep philosophical discussions on God, justice, and human responsibility. The narrative also delves into love, redemption, and the impact of personal choices on others.\n\nBy weaving personal stories with universal questions, the novel provides insight into human nature and the possibility of moral and spiritual reconciliation. It is both a dramatic family story and a meditation on the complexities of life."
  },
  {
    "id": "b6b9cc5d-95fd-488e-b1df-2a805678b430",
    "title": "Microbiology: An Introduction",
    "author": "Matt Haig",
    "genre": "Science / Biology",
    "rating": 4,
    "coverUrl": "https://m.media-amazon.com/images/I/51aUuugYnkL.jpg",
    "coverColor": "#BE2D6B",
    "description": "Cutting edge microbiology research for today's learners. For pre-nursing and allied health students (including mixed-majors courses).",
    "totalCopies": 57,
    "availableCopies": 57,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_jO3MUj8-s.png",
    "summary": "Cutting edge microbiology research for today's learners. For pre-nursing and allied health students (including mixed-majors courses)."
  },
  {
    "id": "8f45a8ad-e0e1-437e-8987-5bcbaca24bd9",
    "title": "Hamlet",
    "author": "William Shakespeare",
    "genre": "Tragedy",
    "rating": 5,
    "coverUrl": "https://m.media-amazon.com/images/I/71uz9igbHrL._SL1500_.jpg",
    "coverColor": "#B12329",
    "description": "A tempest of revenge, madness, and existential torment unfolds in Elsinore's shadowed halls as the Prince of Denmark wrestles with fate and fury.",
    "totalCopies": 50,
    "availableCopies": 45,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_KOYG_-R2J.png",
    "summary": "Hamlet by William Shakespeare is a tragic play that explores themes of revenge, betrayal, madness, and the complexity of the human psyche. The story follows Prince Hamlet of Denmark, who is devastated by the sudden death of his father, King Hamlet, and the hasty remarriage of his mother, Queen Gertrude, to his uncle Claudius, who has seized the throne.\n\nWhen the ghost of Hamlet’s father reveals that Claudius murdered him, Hamlet becomes consumed with thoughts of revenge. He struggles with indecision, moral doubt, and the fear of committing a sinful act, which leads him to feign madness and scheme to expose Claudius’s guilt. His relationships with those around him, including Ophelia, his love, and friends like Horatio, are strained by his erratic behavior and inner turmoil.\n\nThe play builds toward a tragic climax in which betrayal, miscommunication, and vengeance culminate in multiple deaths, including Hamlet’s own. Through Hamlet’s struggle with mortality, ethics, and the human condition, Shakespeare presents a profound exploration of ambition, grief, and the consequences of action and inaction."
  },
  {
    "id": "d125678e-80d7-4ba8-97a6-cc6ee4b980ef",
    "title": "Eloquent Javascript",
    "author": "Marijn Haverbeke",
    "genre": "Programming",
    "rating": 5,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_acYPV3jV0.png",
    "coverColor": "#F8D347",
    "description": "Eloquent JavaScript by Marijn Haverbeke is a deep dive into JavaScript, designed for developers who want to master the language. The book combines clear explanations, practical examples, and exercises to help readers understand both the basics and advanced features of JavaScript.",
    "totalCopies": 121,
    "availableCopies": 120,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_l0umqa2H6.png",
    "summary": "Eloquent JavaScript by Marijn Haverbeke is a deep dive into JavaScript, designed for developers who want to master the language. The book combines clear explanations, practical examples, and exercises to help readers understand both the basics and advanced features of JavaScript. It's ideal for those who are new to the language and for experienced developers looking to refine their skills.\n\nThe book begins with an introduction to programming concepts and quickly transitions into JavaScript fundamentals, including variables, functions, and control structures. It then delves into more advanced topics such as closures, asynchronous programming, and object-oriented design. Haverbeke also explores the JavaScript ecosystem, including browser-based APIs, Node.js, and modern features of the language.\n\nA unique feature of the book is its emphasis on writing elegant, clean, and efficient code. Readers are encouraged to think critically about problem-solving and are provided with exercises that challenge them to apply concepts in real-world scenarios. The book's projects, including building a game and a basic programming language, offer hands-on experience that solidifies learning."
  },
  {
    "id": "cc625b42-6852-44af-b3a3-e668fa967b8e",
    "title": "Cracking the Coding Interview",
    "author": "Gayle Laakmann McDowell",
    "genre": "Programming",
    "rating": 4,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_yryJFVYWd.png",
    "coverColor": "#97cc02",
    "description": "Cracking the Coding Interview by Gayle Laakmann McDowell is a comprehensive guide for software engineers preparing for technical interviews. The book is packed with insights, strategies, and over 180 programming questions that simulate real interview scenarios.",
    "totalCopies": 32,
    "availableCopies": 32,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_vcXsdjkqw.png",
    "summary": "Cracking the Coding Interview by Gayle Laakmann McDowell is a comprehensive guide for software engineers preparing for technical interviews. The book is packed with insights, strategies, and over 180 programming questions that simulate real interview scenarios. It provides not just solutions but also detailed explanations to help readers understand the reasoning and improve their problem-solving skills.\n\nThe book starts by guiding readers through the technical interview process, offering tips on resume optimization, behavioral questions, and understanding what interviewers are looking for. It breaks down complex problems into manageable parts and explains algorithms, data structures, and coding techniques essential for solving them.\n\nA standout feature of the book is its focus on strategies for tackling common topics like arrays, linked lists, trees, graphs, dynamic programming, and system design. McDowell also includes advice on how to handle pressure, communicate effectively during interviews, and debug solutions in real-time, making it more than just a collection of problems—it’s a career toolkit."
  },
  {
    "id": "383a8140-08b8-4c7c-97a7-e1bc68dc1488",
    "title": "Crime & Punishment",
    "author": "Fyodor Dostoevesky",
    "genre": "Psychology / Fiction",
    "rating": 5,
    "coverUrl": "https://m.media-amazon.com/images/I/612KmKeEYEL._SL1500_.jpg",
    "coverColor": "#D2252B",
    "description": "A gripping psychological exploration of guilt, morality, and redemption through the mind of a desperate man wrestling with his darkest deed.",
    "totalCopies": 11,
    "availableCopies": 11,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_0HxM1wQe62.png",
    "summary": "Crime and Punishment by Fyodor Dostoevsky is a psychological and philosophical novel that explores guilt, morality, and the possibility of redemption. The story follows Rodion Raskolnikov, a poor ex-student in St. Petersburg, who believes that certain extraordinary individuals have the right to commit crimes for a greater purpose. Convinced he can justify the murder of a corrupt pawnbroker, he carries out the crime, setting off a chain of events that plunges him into intense guilt and paranoia.\n\nHaunted by his conscience, Raskolnikov becomes increasingly isolated, oscillating between rationalization and self-loathing. His interactions with other characters, particularly Sonia, a humble and devoted young woman who endures hardship with grace, gradually awaken his sense of morality and compassion. Through her influence and his own reflections on justice, suffering, and human connection, he begins to confront the moral consequences of his actions.\n\nUltimately, Raskolnikov confesses to the murder and accepts his punishment in Siberia, embarking on a painful yet transformative journey toward spiritual and moral redemption."
  }
]
